betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_dci.h
/**
  *
  * @file    apm32f4xx_dal_dci.h
  * @brief   Header file of DCI DAL module.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef APM32F4xx_DAL_DCI_H
#define APM32F4xx_DAL_DCI_H

#ifdef __cplusplus
 extern "C" {
#endif

#if defined(APM32F407xx) || defined(APM32F417xx)
/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal_def.h"

/* Include DCI DAL Extended module */
/* (include on top of file since DCI structures are defined in extended file) */
#include "apm32f4xx_dal_dci_ex.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @addtogroup DCI DCI
  * @brief DCI DAL module driver
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup DCI_Exported_Types DCI Exported Types
  * @{
  */
/**
  * @brief   DCI Embedded Synchronisation CODE Init structure definition
  */
typedef struct
{
  uint8_t FrameStartUnmask; /*!< Specifies the frame start delimiter unmask. */
  uint8_t LineStartUnmask;  /*!< Specifies the line start delimiter unmask.  */
  uint8_t LineEndUnmask;    /*!< Specifies the line end delimiter unmask.    */
  uint8_t FrameEndUnmask;   /*!< Specifies the frame end delimiter unmask.   */
}DCI_SyncUnmaskTypeDef;
/**
  * @brief  DAL DCI State structures definition
  */ 
typedef enum
{
  DAL_DCI_STATE_RESET             = 0x00U,  /*!< DCI not yet initialized or disabled  */
  DAL_DCI_STATE_READY             = 0x01U,  /*!< DCI initialized and ready for use    */
  DAL_DCI_STATE_BUSY              = 0x02U,  /*!< DCI internal processing is ongoing   */
  DAL_DCI_STATE_TIMEOUT           = 0x03U,  /*!< DCI timeout state                    */
  DAL_DCI_STATE_ERROR             = 0x04U,  /*!< DCI error state                      */
  DAL_DCI_STATE_SUSPENDED         = 0x05U   /*!< DCI suspend state                    */
}DAL_DCI_StateTypeDef;

/** 
  * @brief  DCI handle Structure definition
  */
typedef struct __DCI_HandleTypeDef
{
  DCI_TypeDef                  *Instance;           /*!< DCI Register base address   */

  DCI_InitTypeDef              Init;                /*!< DCI parameters              */

  DAL_LockTypeDef               Lock;                /*!< DCI locking object          */

  __IO DAL_DCI_StateTypeDef    State;               /*!< DCI state                   */

  __IO uint32_t                 XferCount;           /*!< DMA transfer counter         */

  __IO uint32_t                 XferSize;            /*!< DMA transfer size            */

  uint32_t                      XferTransferNumber;  /*!< DMA transfer number          */

  uint32_t                      pBuffPtr;            /*!< Pointer to DMA output buffer */

  DMA_HandleTypeDef             *DMA_Handle;         /*!< Pointer to the DMA handler   */

  __IO uint32_t                 ErrorCode;           /*!< DCI Error code              */
#if (USE_DAL_DCI_REGISTER_CALLBACKS == 1)
  void    (* FrameEventCallback) ( struct __DCI_HandleTypeDef *hdci);  /*!< DCI Frame Event Callback */
  void    (* VsyncEventCallback) ( struct __DCI_HandleTypeDef *hdci);  /*!< DCI Vsync Event Callback */
  void    (* LineEventCallback ) ( struct __DCI_HandleTypeDef *hdci);  /*!< DCI Line Event Callback  */ 
  void    (* ErrorCallback)      ( struct __DCI_HandleTypeDef *hdci);  /*!< DCI Error Callback       */
  void    (* MspInitCallback)    ( struct __DCI_HandleTypeDef *hdci);  /*!< DCI Msp Init callback    */
  void    (* MspDeInitCallback)  ( struct __DCI_HandleTypeDef *hdci);  /*!< DCI Msp DeInit callback  */  
#endif  /* USE_DAL_DCI_REGISTER_CALLBACKS */ 
}DCI_HandleTypeDef;

#if (USE_DAL_DCI_REGISTER_CALLBACKS == 1)
typedef enum
{
  DAL_DCI_FRAME_EVENT_CB_ID    = 0x00U,    /*!< DCI Frame Event Callback ID */
  DAL_DCI_VSYNC_EVENT_CB_ID    = 0x01U,    /*!< DCI Vsync Event Callback ID */
  DAL_DCI_LINE_EVENT_CB_ID     = 0x02U,    /*!< DCI Line Event Callback ID  */ 
  DAL_DCI_ERROR_CB_ID          = 0x03U,    /*!< DCI Error Callback ID       */
  DAL_DCI_MSPINIT_CB_ID        = 0x04U,    /*!< DCI MspInit callback ID     */
  DAL_DCI_MSPDEINIT_CB_ID      = 0x05U     /*!< DCI MspDeInit callback ID   */
  
}DAL_DCI_CallbackIDTypeDef;
    
typedef void (*pDCI_CallbackTypeDef)(DCI_HandleTypeDef *hdci);
#endif /* USE_DAL_DCI_REGISTER_CALLBACKS */


/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup DCI_Exported_Constants DCI Exported Constants
  * @{
  */

/** @defgroup DCI_Error_Code DCI Error Code
  * @{
  */
#define DAL_DCI_ERROR_NONE      0x00000000U    /*!< No error              */
#define DAL_DCI_ERROR_OVR       0x00000001U    /*!< Overrun error         */
#define DAL_DCI_ERROR_SYNC      0x00000002U    /*!< Synchronization error */
#define DAL_DCI_ERROR_TIMEOUT   0x00000020U    /*!< Timeout error         */
#define DAL_DCI_ERROR_DMA       0x00000040U    /*!< DMA error             */
#if (USE_DAL_DCI_REGISTER_CALLBACKS == 1)
#define DAL_DCI_ERROR_INVALID_CALLBACK ((uint32_t)0x00000080U)  /*!< Invalid callback error */
#endif
/**
  * @}
  */

