betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_dci.h
/** @addtogroup DCI_Exported_Functions_Group3 Peripheral Control functions
 * @{
 */
/* Peripheral Control functions ***********************************************/
DAL_StatusTypeDef DAL_DCI_ConfigCrop(DCI_HandleTypeDef *hdci, uint32_t X0, uint32_t Y0, uint32_t XSize, uint32_t YSize);
DAL_StatusTypeDef DAL_DCI_EnableCrop(DCI_HandleTypeDef *hdci);
DAL_StatusTypeDef DAL_DCI_DisableCrop(DCI_HandleTypeDef *hdci);
DAL_StatusTypeDef DAL_DCI_ConfigSyncUnmask(DCI_HandleTypeDef *hdci, DCI_SyncUnmaskTypeDef *SyncUnmask);
/**
  * @}
  */
  
/** @addtogroup DCI_Exported_Functions_Group4 Peripheral State functions
 * @{
 */
/* Peripheral State functions *************************************************/
DAL_DCI_StateTypeDef DAL_DCI_GetState(DCI_HandleTypeDef *hdci);
uint32_t              DAL_DCI_GetError(DCI_HandleTypeDef *hdci);
/**
  * @}
  */

/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup DCI_Private_Constants DCI Private Constants
  * @{
  */
#define DCI_MIS_INDEX        0x1000U /*!< DCI MIS register index */
#define DCI_STS_INDEX         0x2000U /*!< DCI SR register index  */
/**
  * @}
  */   
/* Private macro -------------------------------------------------------------*/
/** @defgroup DCI_Private_Macros DCI Private Macros
  * @{
  */
#define IS_DCI_CAPTURE_MODE(MODE)(((MODE) == DCI_MODE_CONTINUOUS) || \
                                   ((MODE) == DCI_MODE_SNAPSHOT))

#define IS_DCI_SYNCHRO(MODE)(((MODE) == DCI_SYNCHRO_HARDWARE) || \
                              ((MODE) == DCI_SYNCHRO_EMBEDDED))
                              
#define IS_DCI_PCKPOLARITY(POLARITY)(((POLARITY) == DCI_PCKPOLARITY_FALLING) || \
                                      ((POLARITY) == DCI_PCKPOLARITY_RISING))
                                      
#define IS_DCI_VSPOLARITY(POLARITY)(((POLARITY) == DCI_VSPOLARITY_LOW) || \
                                     ((POLARITY) == DCI_VSPOLARITY_HIGH))
                                     
#define IS_DCI_HSPOLARITY(POLARITY)(((POLARITY) == DCI_HSPOLARITY_LOW) || \
                                     ((POLARITY) == DCI_HSPOLARITY_HIGH))
                                     
#define IS_DCI_MODE_JPEG(JPEG_MODE)(((JPEG_MODE) == DCI_JPEG_DISABLE) || \
                                     ((JPEG_MODE) == DCI_JPEG_ENABLE))
                                     
#define IS_DCI_CAPTURE_RATE(RATE) (((RATE) == DCI_CR_ALL_FRAME)         || \
                                    ((RATE) == DCI_CR_ALTERNATE_2_FRAME) || \
                                    ((RATE) == DCI_CR_ALTERNATE_4_FRAME))
                                    
#define IS_DCI_EXTENDED_DATA(DATA)(((DATA) == DCI_EXTEND_DATA_8B)  || \
                                    ((DATA) == DCI_EXTEND_DATA_10B) || \
                                    ((DATA) == DCI_EXTEND_DATA_12B) || \
                                    ((DATA) == DCI_EXTEND_DATA_14B))
                                    
#define IS_DCI_WINDOW_COORDINATE(COORDINATE) ((COORDINATE) <= DCI_WINDOW_COORDINATE)

#define IS_DCI_WINDOW_HEIGHT(HEIGHT) ((HEIGHT) <= DCI_WINDOW_HEIGHT)

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @addtogroup DCI_Private_Functions DCI Private Functions
  * @{
  */
  
/**
  * @}
  */
      
#endif /* APM32F407xx || APM32F417xx */

/**
  * @}
  */
    
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DAL_DCI_H */
